EDT/УТ/src/Reports/ОтчетКМ6/ОтчетКМ6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетКМ6</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЖурналККМ_КонтрольнаяЛента/ЖурналККМ_КонтрольнаяЛента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЖурналККМ_КонтрольнаяЛента</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Reports/ОтчетКМ6/ObjectModule.bsl
Функция Печать(Таб, ДатаНач, ДатаКон, КассаККМ = Неопределено) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаНачальныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаКонечныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.КассаККМ.Ссылка,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.ТипОплаты.Ссылка
	            |ПОМЕСТИТЬ ВТОстатки
	            |ИЗ
	            |	РегистрНакопления.ЖурналККМ_КонтрольнаяЛента.ОстаткиИОбороты(&НачДата, &КонДата, , , ) КАК ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаНачальныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаКонечныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.КассаККМ.Ссылка,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.ТипОплаты.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ КАК КассаККМ,
	            |	ЖурналККМ_КонтрольнаяЛента.Кассир КАК Кассир,
	            |	ЖурналККМ_КонтрольнаяЛента.ТипОплаты КАК ТипОплаты,
	            |	СУММА(ЖурналККМ_КонтрольнаяЛента.Сумма) КАК Выручка,
	            |	СУММА(ЖурналККМ_КонтрольнаяЛента.СуммаВозврата) КАК Возврат,
	            |	ЖурналККМ_КонтрольнаяЛента.НомерСмены,
	            |	ЕСТЬNULL(ВТОстатки.СуммаНачальныйОстаток, 0) КАК СуммаНаНачало,
	            |	ЕСТЬNULL(ВТОстатки.СуммаКонечныйОстаток, 0) КАК СуммаНаКонец
	            |ИЗ
	            |	РегистрНакопления.ЖурналККМ_КонтрольнаяЛента КАК ЖурналККМ_КонтрольнаяЛента
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	            |		ПО ЖурналККМ_КонтрольнаяЛента.КассаККМ.Ссылка = ВТОстатки.КассаККМСсылка.Ссылка
	            |			И ЖурналККМ_КонтрольнаяЛента.ТипОплаты.Ссылка = ВТОстатки.ТипОплатыСсылка.Ссылка
	            |ГДЕ
	            |	ЖурналККМ_КонтрольнаяЛента.Период МЕЖДУ &НачДата И &КонДата
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ,
	            |	ЖурналККМ_КонтрольнаяЛента.Кассир,
	            |	ЖурналККМ_КонтрольнаяЛента.ТипОплаты,
	            |	ЖурналККМ_КонтрольнаяЛента.НомерСмены,
	            |	ЕСТЬNULL(ВТОстатки.СуммаНачальныйОстаток, 0),
	            |	ЕСТЬNULL(ВТОстатки.СуммаКонечныйОстаток, 0)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	КассаККМ,
	            |	Кассир
	            |ИТОГИ ПО
	            |	КассаККМ,
	            |	Кассир,
	            |	ТипОплаты
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТОстатки";
				
				
	зап.УстановитьПараметр("НачДата", НачалоДня(ДатаНач));			
	зап.УстановитьПараметр("КонДата", КонецДня(ДатаНач));			
	//Таб = Новый ТабличныйДокумент;
	Мак = ПолучитьМакет("Макет");
	
	Ш = мак.ПолучитьОбласть("Шапка");
	ОблСтр = мак.ПолучитьОбласть("Строка");
	П = мак.ПолучитьОбласть("Подвал");
	
	
	
	ВыбККМ = Зап.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыбККМ.Следующий() Цикл
		ВыбКассир = ВыбККМ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбКассир.Следующий() Цикл
			ВыбВО = ВыбКассир.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыбВО.Следующий() Цикл
				ВыбСм = ВыбВО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыбСм.Следующий() Цикл
					
					ИтСум = ВыбСм.Выручка;
					ИтСумВ = ВыбСм.Возврат;
					ККМ = ВыбККМ.КассаККМ;
					Кассир = ВыбКассир.Кассир;
					ВО = ВыбСм.ТипОплаты;
					
					Ш.Параметры.Кассир = Кассир;
					Ш.Параметры.ТипОплаты = ВО;
					Ш.Параметры.ДатаСоставления = ДатаКон;
					
					Ш.Параметры.Модель = ККМ.Модель;
					Ш.Параметры.ПрикладнаяПрограмма = ККМ.ПрикладнаяПрограмма;
					Ш.Параметры.НомерПроизводителя = ККМ.НомерПроизводителя;
					Таб.Вывести(Ш);
					
					ВыбДет = ВыбВО.Выбрать();
					НПП = 1;
					Пока ВыбДет.Следующий() Цикл
						//ОблСтр.Параметры.НомерСмены = ВыбДет.НомерСмены;
						////ОблСтр.Параметры.НаимОтдела = ВыбДет.Секция;
						////ОблСтр.Параметры.НомерЧека = ВыбДет.НЧ;
						//ОблСтр.Параметры.Сумма = ВыбДет.Сумма;
						//ОблСтр.Параметры.Кассир = Кассир;
						ЗаполнитьЗначенияСвойств(ОблСтр.Параметры, ВыбДет);
						Таб.Вывести(ОблСтр);
						НПП = НПП + 1;
					КонецЦикла;	
					ДФ = Формат(ДатаКон, "ДЛФ=DD");
					П.Параметры.ДД = Лев(ДФ, 2);
					П.Параметры.МД = Сред(ДФ, 4, СтрДлина(ДФ) - 10);
					П.Параметры.ГД = Лев(Прав(ДФ, 7), 4);
					П.Параметры.ИтВыручка = ИтСум;
					П.Параметры.ИтВозврат = ИтСумВ;
					П.Параметры.СуммаВыручкиСтрока = ОбщегоНазначения.СформироватьСуммуПрописью3(ИтСум - ИтСумВ);
					Таб.Вывести(П);
					Таб.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	
	таб.КлючПараметровПечати = "КМ6_";
	Возврат Истина;
КонецФункции
